       01 REGISTRO.
          05 REG-AGENCIA   picture X(04).
          05 REG-CONTA     picture X(05).
          05 REG-NOME      picture X(30).
          05 REG-GERENTE   picture X(03).
          05 REG-TIPO-CONTA picture 9(01).
          05 REG-SALDO     picture 9(10)V99.