       identification division.
       program-id. OLACOBOL.
       procedure division.
           display "Hello, COBOL World!".
           stop run.